Clash Bot Webapp Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot-Webapp/runs/run-E6zcrJM7o5YHWrkz

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
data.tfe_outputs.clash-bot-discord-bot: Reading...
data.tfe_outputs.clash-bot-discord-bot: Read complete after 0s [id=ClashBot-ClashBot]
aws_iam_policy.webapp_ecr_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-webapp-ecr-ecs-policy]
aws_security_group.clash-bot-webapp-sg: Refreshing state... [id=sg-0a806c6bf3b23a5b2]
aws_cloudwatch_log_group.clash-bot-ws-task-logs: Refreshing state... [id=clash-bot-webapp-ws-ecs-task-logs]
aws_dynamodb_table.clash-bot-association-table: Refreshing state... [id=clash-user-team-associations]
aws_dynamodb_table.clash-bot-teams-table: Refreshing state... [id=server-clash-teams]
aws_lb_target_group.clash-bot-ws-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:targetgroup/clash-bot-webapp-ws-tg/ca204c020ff70c8b]
aws_iam_role.clash-bot-ws-exec-role: Refreshing state... [id=clash-bot-webapp-ws-exec-role]
data.aws_caller_identity.current: Reading...
aws_iam_role.clash-bot-webapp-task-role: Refreshing state... [id=clash-bot-webapp-webapp-task-role]
aws_iam_policy.webapp_dynamodb_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-dynamodb-ecs-policy]
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
aws_cloudwatch_log_group.clash-bot-webapp-task-logs: Refreshing state... [id=clash-bot-webapp-ecs-task-logs]
aws_lb_target_group.clash-bot-webapp-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:targetgroup/clash-bot-webapp-webapp-tg/c7c05d33183240aa]
aws_iam_role.clash-bot-webapp-exec-role: Refreshing state... [id=clash-bot-webapp-webapp-exec-role]
aws_iam_policy.ws_ecr_registry_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-ws-ecr-ecs-registry-policy]
aws_iam_policy.webapp_ecr_registry_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-webapp-ecr-ecs-registry-policy]
aws_iam_policy.ws_logs_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-ws-ecs-logs-policy]
aws_iam_policy.webapp_logs_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-webapp-ecs-logs-policy]
aws_security_group.clash-bot-ws-task-sg: Refreshing state... [id=sg-02a58c75d03781b38]
aws_security_group.clash-bot-webapp-task-sg: Refreshing state... [id=sg-0e662860b61109e26]
aws_lb.clash-bot-webapp-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:loadbalancer/app/clash-bot-webapp-lb/52dfd6c162e76ad4]
aws_lb_listener.clash-bot-webapp-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57]
aws_lb_listener_rule.webapp_safe_traffic: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener-rule/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57/f3960cf72b6d4396]
aws_lb_listener_rule.ws_safe_traffic: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener-rule/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57/9ddb531e31695377]
aws_iam_role_policy_attachment.ecs-ws-logs-policy-attachment: Refreshing state... [id=clash-bot-webapp-ws-exec-role-20220815215512305000000006]
aws_iam_role_policy_attachment.ecs-ws-ecr-policy-attachment: Refreshing state... [id=clash-bot-webapp-ws-exec-role-20220815215512295800000005]
aws_iam_role_policy_attachment.ecs-dynamodb-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-task-role-20220815215512205300000004]
aws_ecs_task_definition.clash-bot-ws-service-task-def: Refreshing state... [id=clash-bot-webapp-ws]
aws_iam_role_policy_attachment.ecs-ecr-ws-repository-policy-attachment: Refreshing state... [id=clash-bot-webapp-ws-exec-role-20220815215512305100000007]
aws_iam_role_policy_attachment.ecs-logs-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-exec-role-20220815215512128100000001]
aws_iam_role_policy_attachment.ecs-ecr-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-exec-role-20220815215512138400000002]
aws_iam_role_policy_attachment.ecs-ecr-repository-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-exec-role-20220815215512166300000003]
aws_ecs_service.clash-bot-ws-service: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-ws-service]
aws_ecs_task_definition.clash-bot-webapp-task-def: Refreshing state... [id=clash-bot-webapp-service]
aws_ecs_service.clash-bot-webapp-service: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.clash-bot-auth-secret-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "clash-bot-auth-secret-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::816923827429:role/clash-bot-webapp-auth-task-role",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudwatch_log_group.clash-bot-auth-task-logs will be created
  + resource "aws_cloudwatch_log_group" "clash-bot-auth-task-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "clash-bot-webapp-auth-ecs-task-logs"
      + retention_in_days = 120
      + tags_all          = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_ecs_service.clash-bot-auth-service will be created
  + resource "aws_ecs_service" "clash-bot-auth-service" {
      + cluster                            = (sensitive)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "clash-bot-webapp-auth-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "clash-bot-webapp-ecs-service"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-service"
          + "Type"        = "Webapp"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "clash-bot-webapp-auth-service"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive)
        }
    }

  # aws_ecs_service.clash-bot-webapp-service will be updated in-place
  ~ resource "aws_ecs_service" "clash-bot-webapp-service" {
      + force_new_deployment               = true
        id                                 = "arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-service"
        name                               = "clash-bot-webapp-service"
        tags                               = {
            "Name" = "clash-bot-webapp-ecs-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-service:13" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.clash-bot-ws-service will be updated in-place
  ~ resource "aws_ecs_service" "clash-bot-ws-service" {
      + force_new_deployment               = true
        id                                 = "arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-ws-service"
        name                               = "clash-bot-webapp-ws-service"
        tags                               = {
            "Name" = "clash-bot-webapp-ws-ecs-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-ws:10" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.clash-bot-auth-task-def will be created
  + resource "aws_ecs_task_definition" "clash-bot-auth-task-def" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "clash-bot-webapp-auth-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "clash-bot-webapp-task"
          + "Release" = "PR Build"
        }
      + tags_all                 = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-task"
          + "Release"     = "PR Build"
          + "Type"        = "Webapp"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_ecs_task_definition.clash-bot-webapp-task-def must be replaced
-/+ resource "aws_ecs_task_definition" "clash-bot-webapp-task-def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-service:13" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "clash-bot-webapp-service" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 13 -> (known after apply)
      ~ tags                     = {
          ~ "Release" = "" -> "PR Build"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "Release"     = "" -> "PR Build"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.clash-bot-ws-service-task-def must be replaced
-/+ resource "aws_ecs_task_definition" "clash-bot-ws-service-task-def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-ws:10" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "clash-bot-webapp-ws" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 10 -> (known after apply)
      ~ tags                     = {
          ~ "Release" = "" -> "PR Build"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "Release"     = "" -> "PR Build"
            # (3 unchanged elements hidden)
        }
      - task_role_arn            = "" -> null
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.auth_dynamodb_iam_policy will be created
  + resource "aws_iam_policy" "auth_dynamodb_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-dynamodb-ecs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.auth_ecr_iam_policy will be created
  + resource "aws_iam_policy" "auth_ecr_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-auth-ecr-ecs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.auth_ecr_registry_iam_policy will be created
  + resource "aws_iam_policy" "auth_ecr_registry_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-auth-ecr-ecs-registry-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.auth_logs_iam_policy will be created
  + resource "aws_iam_policy" "auth_logs_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-auth-ecs-logs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_role.clash-bot-auth-exec-role will be created
  + resource "aws_iam_role" "clash-bot-auth-exec-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-webapp-auth-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.clash-bot-auth-task-role will be created
  + resource "aws_iam_role" "clash-bot-auth-task-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-webapp-auth-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs-auth-ecr-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-auth-ecr-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-auth-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-auth-ecr-repository-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-auth-ecr-repository-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-auth-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-auth-logs-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-auth-logs-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-auth-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-auth-secret-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-auth-secret-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-auth-task-role"
    }

  # aws_lb_target_group.clash-bot-auth-tg will be created
  + resource "aws_lb_target_group" "clash-bot-auth-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "clash-bot-webapp-auth-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "clash-bot-webapp-ecs-tg"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-tg"
          + "Type"        = "Webapp"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/api/v2/health"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_secretsmanager_secret.one will be created
  + resource "aws_secretsmanager_secret" "one" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (sensitive)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.two will be created
  + resource "aws_secretsmanager_secret" "two" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (sensitive)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.one_version will be created
  + resource "aws_secretsmanager_secret_version" "one_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.two_version will be created
  + resource "aws_secretsmanager_secret_version" "two_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.clash-bot-auth-task-sg will be created
  + resource "aws_security_group" "clash-bot-auth-task-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a806c6bf3b23a5b2",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "clash-bot-webapp-ecs-task-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "clash-bot-webapp-ecs-task-sg"
        }
      + tags_all               = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-task-sg"
          + "Type"        = "Webapp"
        }
      + vpc_id                 = (sensitive)
    }

Plan: 21 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ webapp_task_definition_version = 13 -> (known after apply)
  ~ ws_task_definition_version     = 10 -> (known after apply)

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*